PackageHandoff.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Package Handoff</title>
<!-- 2016-09-26 Mon 19:12 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Gaurish" />
<link rel="stylesheet" type="text/css" href="org-style.css"/>

</head>
<body>
<div id="content">
<h1 class="title">Package Handoff</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Theory</a></li>
<li><a href="#sec-3">3. Experiments</a>
<ul>
<li><a href="#sec-3-1">3.1. Specification</a></li>
<li><a href="#sec-3-2">3.2. Layout</a></li>
<li><a href="#sec-3-3">3.3. Library Source Code</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1. PackageHandoffPrelude.hs</a></li>
<li><a href="#sec-3-3-2">3.3.2. SinglePackageRouting.hs</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
An interesting Euclidean Steiner-Tree like question was posed by Prof. Mitchell while discussing
a paper by Craig Tovey giving heuristics for transporting multiple packages from their sources
to destinations along a graph with \(r\) co-ordinating carrier robots.
</p>

<blockquote>
<p>
There are \(m\) mobile carrier-robots located initially at \(\{(x^{r}_j, y^{r}_j)\}_{j=1}^m \subseteq \mathbb{R}^2\).
For each \(j\), where \(1 \leq j \leq m\), robot \(r_j\) is able to move in any direction with a maximum speed \(v_j\).
If two robots meet at a point in the course of their motion, they can exchange an arbitrary number of
items they each carry. For simplicity, each of the \(m\) robots can be assumed to have infinite fuel and
an infinite weight-carrying capacity.
</p>

<p>
If you are given \(n\) stationary packages tagged \(p_1, p_2, \ldots p_n\) located respectively at
\(\{(x^{s}_i, y^{s}_i)\}_{i=1}^n\) all of which must get to their destinations \(\{(x^{t}_i, y^{t}_i)\}_{i=1}^n\)
using the \(m\) robots, how can you construct a schedule for the robots to transport
all packages to their destinations "quickly" ?
</p>
</blockquote>

<p>
Depending on the interpretation of "quick", we get different cost criteria. e.g. <i><b>min-sum</b></i>:
the sum of the travel times of the packages and <i><b>min-max</b></i>: the time required for the last package
to get to its destination.
</p>

<p>
A nice real world instance of this problem is one where a taxi-service must co-ordinate
its fleet of cabs to transport passengers located at different points on the map, to
their destinations.
</p>

<p>
Here are a few variants or special cases of the above problem that might be of independent interest.
</p>

<ul class="org-ul">
<li>What if only one package needs to be transported i.e. \(n=1\) ? In this case, min-sum and
min-max yield the same cost function.
</li>
<li>What if \(n=1\) <i>and</i> the package must move along a straight-line from its source all the way
to its destination. This is also an interesting question for the multiple-robot case.
 i.e. all packages must move along a straight line from their origin to their destination.
</li>
<li>What if \(n=2\)?
</li>
<li>What if every robot could travel with the same maximum speed \(v_j=V\) but has only limited fuel.
Two additional sub-constraints might be of interest.
<ul class="org-ul">
<li>What if every robot is constrained to move back into its original position after it does
all its handoffs as required by the schedule.
</li>
<li>What if a robot is allowed to move only along the horizontal and vertical directions?
</li>
</ul>
</li>
<li>Is there a continuous version of this problem? By that I mean, could robots be thought of
as distributed uniformly throughout the domain?
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Theory</h2>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Experiments</h2>
<div class="outline-text-2" id="text-3">
<p>
I've created a Github repository, <b><a href="https://github.com/gtelang/packagehandoff">packagehandoff</a></b> ,which contains the Haskell code for experimenting
with various heuristics for solving package-handoff problems. That repository also contains a wiki 
containing a motley collection of checklists, todos, braindumps and notes-to-self being made while 
designing library.
</p>

<p>
The base of the code is similar to that of Pulleys and r-Gather in Python. 
Here I plan to principally use Haskell. Besides Haskell also some really interesting libraries like quickcheck, 
reactive-banana, gloss, Diagrams, lenses, the FGL and GSL bindings, the parallelism on offer and of course as 
a design langauge for algorithms using its type-system. Besides, gloss apparently performs extremely well under 
threading. 
</p>

<p>
The most important libraries for performing geometric computations will be
</p>
<ol class="org-ol">
<li>Reactive Banana
</li>
<li>CGAL (via C-wrappers)
</li>
<li>GSL  (via C-wrappers)
</li>
<li>Diagrams (for its computations): (it does have the left turn thing)
</li>
<li>Shewchuk's predicates (directly via the FFI)
</li>
<li>Cplex-interface (for optimization)
</li>
<li>GLPK-interface  (for linear programming)
</li>
<li>FGL (native Haskell), iGraph and the BGL( both with C bindings via FFI)
</li>
<li>GeoSteiner (C bindings via the FFI)
</li>
<li>Liquid-Haskell and the Dependent Types Extension (for stronger types)
</li>
</ol>

<p>
Different heuristics for both single and multi-package routine will be implemented atop the following interactive system
outline in the next section. 
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Specification</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The executable is started in one of two modes. 
</p>

<div class="org-src-container">

<pre class="src src-sh">&lt;prompt&gt; ./main --variable-velocity <span style="color: #586e75;"># </span><span style="color: #808080; font-style: italic;">Fuel = &#8734; &#8704; robots,</span>
&lt;prompt&gt; ./main --bounded-fuel <span style="color: #586e75;"># </span><span style="color: #808080; font-style: italic;">Max-Velocity = 1.0 &#8704; robots</span>
</pre>
</div>
<p>
Depending on the modes, the appropriate algorithms are activated.  Once the schedule 
has been computed, it is written out as a  YAML file, then rendered or animated. <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>

<p>
Data is inserted into the canvas as follows. 
</p>
<dl class="org-dl">
<dt> Left-mouse button <b>dbl-click</b> </dt><dd><font color = "red"> Insert Robots   </font>
</dd>
<dt> Right-mouse button <b>dbl-click</b> </dt><dd><font color = "red"> Insert Packages    </font>
</dd>
<dt> Scroll-wheel </dt><dd><ul class="org-ul">
<li><font color = "red">Adjust fuel (disk size) </font>  
</li>
<li><font color = "red">Adjust speed (disk color on a spectrum) </font>
</li>
</ul>
</dd>
<dt> Right-mouse button <b>single-click</b> </dt><dd>     When done on robots/packages select for editing
<dl class="org-dl">
<dt> Left-mouse <b>drag</b>  </dt><dd>Translate robots/packages as a group
</dd>
<dt> Scroll-Wheel </dt><dd>Adjust group properties in increments
</dd>
<dt> Delete </dt><dd>Delete group
</dd>
</dl>
</dd>
</dl>

<p>
I will be using all of Diagrams' inbuilt data-types for things such as points, 
vectors, planes and other things. I might have to use gloss3d/OpenGL/three.js(via GHCJS)
for visualizing problems like these in 3d.
</p>

<p>
For many sophisticated algorithms, I shall be using CGAL. For the simpler ones, we have Diagrams 
and Boost::Geometry. Examples of algorithms available in the latter are: 
</p>
<ul class="org-ul">
<li>Area and Perimeter
</li>
<li>Centroid
</li>
<li>Convex Hull
</li>
<li>Axis Aligned Bounding Box etc.
</li>
<li>Unions and <a href="http://www.boost.org/doc/libs/1_61_0/libs/geometry/doc/html/geometry/reference/algorithms/intersection.html">Intersections</a> of two geometries, like polygons! 
</li>
</ul>
<p>
The full list of algorithms in Boost::Geometry is available <a href="http://www.boost.org/doc/libs/1_61_0/libs/geometry/doc/html/geometry/reference/algorithms.html">here</a>:
</p>

<p>
Much of BoostGeometry code is based on the notion of C++ concepts, which are very 
similar to Haskell's typeclasses. 
</p>
</div>
</div>
