PackageHandoff.org
** Layout   
The layout of the code files will be as follows:

- Main.hs ::  All setup, profiling work goes here. When your program starts
              maturing, start having independent org files for the main.hs files
              which setup different sorts of experiments. This imports algorithmX
              and calls it via play in addition to any other profiling steps.
              These go into the /app/ folder. 
 
- PackageHandoffUtilities.hs :: Common functions, typeclasses, event handlers etc.

- ProbX.hs ::  Variants we will be trying to solve are:
     - OnePackageVariableVelocity.hs 
     - MultiPackageVariableVelocity.hs
     - OnePackageBoundedFuel.hs
     - MultiPackageBoundedFuel.hs

  These four files will be instantiating typeclasses for robots and implementing 
  approximation algorithms for min-sum and min-max variants.

** Library Source Code
Each subsection here describes the source-code inside the file given by the subsection heading. 
For the /Main.hs/ files, have a look inside *codeHaskell-pho/app*
*** PackageHandoffPrelude.hs
:PROPERTIES:
:TANGLE: codeHaskell-pho/src/PackageHandoffPrelude.hs
:END:

*PackageHandoffPrelude.hs* contains data-structures and routines common to all package-handoff 
variants. This section describes the code therein. First, import necessary libraries and make 
some descriptive type-synonyms. 
 
#+BEGIN_SRC haskell :tangle codeHaskell-pho/src/PackageHandoffPrelude.hs
  -- | Common Data-Structures and Functions.

  {-# LANGUAGE NoMonomorphismRestriction #-}
  module PackageHandoffPrelude where
  import Diagrams.Prelude
  import qualified Data.Map as Map
  -- TODO: Use Liquid Haskell to enforce ≥ 0 at the type level
  type Speed    = Double -- | ≥ 0
  type Fuel     = Double -- | ≥ 0
  type Time     = Double -- | ≥ 0
  type PkgIndex = Int    -- | ≥ 0 
#+END_SRC

The *Robot* data-type stores information about a single robot such as its positions at time $t=0$
maximum speed, fuel capacity and other input-data. 
#+BEGIN_SRC haskell :tangle codeHaskell-pho/src/PackageHandoffPrelude.hs
  data Robot = Robot { initPosition :: Point V2 Double, 
                       maxSpeed     :: Speed          ,
                       maxFuel      :: Fuel 
                      } deriving (Show)
#+END_SRC

The *Package* data-type stores the Cartesian co-ordinates of the *source* and *target* points 
of a package.
#+BEGIN_SRC haskell  :tangle codeHaskell-pho/src/PackageHandoffPrelude.hs
  data Package = Package { source :: Point V2 Double,
                           target :: Point V2 Double 
                         } deriving (Show)
#+END_SRC

The *World* data-type stores information about the robots and packages obtained from 
input source (e.g. the Gloss canvas or a YAML file)  
#+BEGIN_SRC haskell :tangle codeHaskell-pho/src/PackageHandoffPrelude.hs
  data World = World { robots      :: [Robot]  ,    
                       packages    :: [Package]    
                     } deriving (Show)
#+END_SRC

Note that *World* knows _nothing_ about the input source from which it came: 
it might have been a file, or it could have been inserted via a Gloss or a Diagrams canvas.  
Keeping the algorithmic and the input/output codes strictly decoupled is essential for making 
the code more modular. Besides, it is apossible that using javascript libraries via GHCJS might 
be an excellent option in the future for creating more sophisticated animations (e.g. using D3 and three.js)
and possibly even for three dimensions.

It also doesn't know anything about the time on the clock. /That/ clocking will be taken care 
by a wrapper data-structure used by the visualization/animation routines of diagrams or gloss.

