PackageHandoff.html
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Layout</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The layout of the code files will be as follows:
</p>

<dl class="org-dl">
<dt> Main.hs </dt><dd>All setup, profiling work goes here. When your program starts
maturing, start having independent org files for the main.hs files
which setup different sorts of experiments. This imports algorithmX
and calls it via play in addition to any other profiling steps.
These go into the <i>app</i> folder. 
</dd>

<dt> PackageHandoffUtilities.hs </dt><dd>Common functions, typeclasses, event handlers etc.
</dd>

<dt> ProbX.hs </dt><dd>Variants we will be trying to solve are:
<ul class="org-ul">
<li>OnePackageVariableVelocity.hs 
</li>
<li>MultiPackageVariableVelocity.hs
</li>
<li>OnePackageBoundedFuel.hs
</li>
<li>MultiPackageBoundedFuel.hs
</li>
</ul>
<p>
These four files will be instantiating typeclasses for robots and implementing 
approximation algorithms for min-sum and min-max variants.
</p>
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Library Source Code</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Each subsection here describes the source-code inside the file given by the subsection heading. 
For the <i>Main.hs</i> files, have a look inside <b>codeHaskell-pho/app</b>
</p>
</div>
<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> PackageHandoffPrelude.hs</h4>
<div class="outline-text-4" id="text-3-3-1">

<p>
<b>PackageHandoffPrelude.hs</b> contains data-structures and routines common to all package-handoff 
variants. This section describes the code therein. First, import necessary libraries and make 
some descriptive type-synonyms. 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #2aa198;">-- | Common Data-Structures and Functions.</span>

<span style="color: #268bd2;">{-# LANGUAGE NoMonomorphismRestriction #-}</span>
<span style="color: #859900; font-weight: bold;">module</span> <span style="color: #b58900; font-weight: bold;">PackageHandoffPrelude</span> <span style="color: #859900; font-weight: bold;">where</span>
<span style="color: #859900; font-weight: bold;">import</span> <span style="color: #b58900; font-weight: bold;">Diagrams.Prelude</span>
<span style="color: #859900; font-weight: bold;">import</span> <span style="color: #859900; font-weight: bold;">qualified</span> <span style="color: #b58900; font-weight: bold;">Data.Map</span> <span style="color: #859900; font-weight: bold;">as</span> <span style="color: #b58900; font-weight: bold;">Map</span>
<span style="color: #586e75;">-- </span><span style="color: #cc9393;">TODO</span><span style="color: #808080; font-style: italic;">: Use Liquid Haskell to enforce &#8805; 0 at the type level</span>
<span style="color: #859900; font-weight: bold;">type</span> <span style="color: #b58900; font-weight: bold;">Speed</span>    <span style="color: #268bd2;">=</span> <span style="color: #b58900; font-weight: bold;">Double</span> <span style="color: #2aa198;">-- | &#8805; 0</span>
<span style="color: #859900; font-weight: bold;">type</span> <span style="color: #b58900; font-weight: bold;">Fuel</span>     <span style="color: #268bd2;">=</span> <span style="color: #b58900; font-weight: bold;">Double</span> <span style="color: #2aa198;">-- | &#8805; 0</span>
<span style="color: #859900; font-weight: bold;">type</span> <span style="color: #b58900; font-weight: bold;">Time</span>     <span style="color: #268bd2;">=</span> <span style="color: #b58900; font-weight: bold;">Double</span> <span style="color: #2aa198;">-- | &#8805; 0</span>
<span style="color: #859900; font-weight: bold;">type</span> <span style="color: #b58900; font-weight: bold;">PkgIndex</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900; font-weight: bold;">Int</span>    <span style="color: #2aa198;">-- | &#8805; 0</span>
</pre>
</div>

<p>
The <b>Robot</b> data-type stores information about a single robot such as its positions at time \(t=0\)
maximum speed, fuel capacity and other input-data. 
</p>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">data</span> <span style="color: #b58900; font-weight: bold;">Robot</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900; font-weight: bold;">Robot</span> <span style="color: #2aa198;">{</span> initPosition <span style="color: #268bd2;">::</span> <span style="color: #b58900; font-weight: bold;">Point</span> <span style="color: #b58900; font-weight: bold;">V2</span> <span style="color: #b58900; font-weight: bold;">Double</span><span style="color: #268bd2;">,</span> 
                     maxSpeed     <span style="color: #268bd2;">::</span> <span style="color: #b58900; font-weight: bold;">Speed</span>          <span style="color: #268bd2;">,</span>
                     maxFuel      <span style="color: #268bd2;">::</span> <span style="color: #b58900; font-weight: bold;">Fuel</span> 
                    <span style="color: #2aa198;">}</span> <span style="color: #859900; font-weight: bold;">deriving</span> <span style="color: #2aa198;">(</span><span style="color: #b58900; font-weight: bold;">Show</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
The <b>Package</b> data-type stores the Cartesian co-ordinates of the <b>source</b> and <b>target</b> points 
of a package.
</p>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">data</span> <span style="color: #b58900; font-weight: bold;">Package</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900; font-weight: bold;">Package</span> <span style="color: #2aa198;">{</span> source <span style="color: #268bd2;">::</span> <span style="color: #b58900; font-weight: bold;">Point</span> <span style="color: #b58900; font-weight: bold;">V2</span> <span style="color: #b58900; font-weight: bold;">Double</span><span style="color: #268bd2;">,</span>
                         target <span style="color: #268bd2;">::</span> <span style="color: #b58900; font-weight: bold;">Point</span> <span style="color: #b58900; font-weight: bold;">V2</span> <span style="color: #b58900; font-weight: bold;">Double</span> 
                       <span style="color: #2aa198;">}</span> <span style="color: #859900; font-weight: bold;">deriving</span> <span style="color: #2aa198;">(</span><span style="color: #b58900; font-weight: bold;">Show</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
The <b>World</b> data-type stores information about the robots and packages obtained from 
input source (e.g. the Gloss canvas or a YAML file)  
</p>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">data</span> <span style="color: #b58900; font-weight: bold;">World</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900; font-weight: bold;">World</span> <span style="color: #2aa198;">{</span> robots      <span style="color: #268bd2;">::</span> <span style="color: #b58900;">[</span><span style="color: #b58900; font-weight: bold;">Robot</span><span style="color: #b58900;">]</span>  <span style="color: #268bd2;">,</span>    
                     packages    <span style="color: #268bd2;">::</span> <span style="color: #b58900;">[</span><span style="color: #b58900; font-weight: bold;">Package</span><span style="color: #b58900;">]</span>    
                   <span style="color: #2aa198;">}</span> <span style="color: #859900; font-weight: bold;">deriving</span> <span style="color: #2aa198;">(</span><span style="color: #b58900; font-weight: bold;">Show</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
Note that <b>World</b> knows <span class="underline">nothing</span> about the input source from which it came: 
it might have been a file, or it could have been inserted via a Gloss or a Diagrams canvas.  
Keeping the algorithmic and the input/output codes strictly decoupled is essential for making 
the code more modular. Besides, it is apossible that using javascript libraries via GHCJS might 
be an excellent option in the future for creating more sophisticated animations (e.g. using D3 and three.js)
and possibly even for three dimensions.
</p>

<p>
It also doesn't know anything about the time on the clock. <i>That</i> clocking will be taken care 
by a wrapper data-structure used by the visualization/animation routines of diagrams or gloss.
</p>
</div>

<ol class="org-ol"><li><a id="sec-3-3-1-1" name="sec-3-3-1-1"></a><b><span class="underline">Gloss Canvas IO</span></b><br  /><div class="outline-text-5" id="text-3-3-1-1">
<p>
